{
  "sections": {
    "personal_info": {
      "text": "ANGELINA MENCHON DYER, MSC  \nProduct Leader | Driving Innovation, Amazing Customer Experiences, AI & Cutting-Edge Technology  \nPorfolio\nLow Code (FlutterFlow) App Development"
    },
    "professional_summary": {
      "text": "Experienced Product Manager with 11 years working in the tech industry, specialising in driving product vision and strategy within digital and innovation environments. Skilled at driving the launch of greenfield products to deliver IoT, cloud, and AI-powered solutions. Seeking product manager or product owner roles in startups or established companies focused on innovative technologies and revenue growth."
    },
    "achievements": {
      "text": "Launched a data dashboard with LLM Gen AI technology enabling the business to make decisions on multi-million pound cost saving initiatives  \nAt H&C TV I achieved +500% subscriber growth in 3.7 years  \nLaunched the 1st Simply Be retail app, generating £1M+ in less than a year  \nCreated and presented £100K+ proposals to win projects internally at PWC\nLevel 1 Certified Scuba diver"
    },
    "work_experience": {
      "text": "Senior Product Manager (Contract)  \n11/2025 – 04/2025  \nthebigword  \nThebigword is a global language technology company, providing translation and interpreting services across government and enterprise sectors. I managed their flagship interpreting product portfolio—a complex B2B2C marketplace platform that provided face-to-face and video remote services, matching interpreters with clients using advanced machine learning and algorithmic logic. High-profile users included the Ministry of Justice (MOJ).  \nReprioritised the 2025 roadmap based on commercial impact—replacing a 3–6 month development initiatives with features expected to bring in significantly more value (£100K vs £10K) to the business.  \nPartnered with compliance and legal teams to implement GDPR-aligned processes, including Right to be Forgotten, ensuring platform compliance across high-sensitivity use cases.  \nLed discovery initiatives to understand complex interpreter and client data such as qualifications, interpreter matching and rates to meet compliance standards and complex client-specific rate structures.  \nDefined and maintained the feature roadmap for multiple cross-functional business initiatives, aligning with strategic goals and stakeholder priorities.  \nAttended client sites and industry summits to gather insights and user feedback, using findings to guide product decisions.  \nInitiate and coordinate early-stage planning for a generative AI integration project with an LLM provider, including a proof of concept (POC)  \nLine management of a UX designer and Junior Product Manager  \nWorked across multiple platforms (Mobile App & Web) and regions (UK and EU)  \n\nSenior Product Owner / Product Manager (Contract)  \n01/2024 – 11/2024  \nJet2 Holidays (Package Holiday Provider)  \nCovered a maternity leave, led Jet2's Pre-Travel data workstream and contributing to the overall strategy and roadmap. Leading the first-ever use of Generative AI within the workstream to analyse data and generate insights for strategic decision-making, aimed at drivi\nProduct Manager (Contract)  \n04/2023 \u0000 10/2023  \nPWC (Digital Consultancy)  \nHelped secure proposals for a portfolio of internal projects valued at £100K, with potential cost savings in the millions. Led the launch of projects focused on the automation of processes to enhance data workflows and improve overall workforce productivity.  \nLed multiple compliance and risk assessments, particularly in highly regulated sectors (e.g. financial audits at PwC\u0000, ensuring secure and responsible product delivery.  \nLed product discovery sessions to understand business value of launching products by looking at pain points, possible gains and overall impact within the business  \nManaged a cross-functional development team (developers, UI/UX designers, testers) to deliver low-code internal data products  \nCollaborated with stakeholders to build strategic product roadmaps, introducing practices such as the RICE model  \nBudget tracking across multiple product. Contributed as a member of the Product Management Community of Practice, supported colleagues with product knowledge  \n\nSenior Product Manager (Contract)  \n01/2023 \u0000 03/2023  \nBBC Bitesize (Broadcasting & Education)  \nDelivered a strategic roadmap for the BBC to increase user engagement, a\n\"Aligned with business goals. Conducted extensive research, utilising external user research results and internal data analytics, to enhance customer journeys and optimise user experience. Led a discovery project to enhance site engagement, working closely with stakeholders Utilised research and collaborated with data analysts to set up key insights and reporting Provided product strategy and roadmap recommendations Worked with stakeholders \u0000Editorial, leads, product managers, UI/UX\u0000 to bring concepts to life Operated within a technology change and transformation environment Director of Product 12/2018 \u0000 07/2022 H&C TV (Equestrian Video Subscription Service) Managed the Customer Experience and Product departments, delivering key roadmap initiatives aligned with business goals. These efforts contributed to a significant financial turnaround, increasing revenue from a negative position to £3M with strong year-on-year growth. Promoted to Director within a year by aligning product delivery with commercial objectives, driving platform growth across mobile, web, and connected TV. Partnered with marketing to develop CRM journeys across email, app, and push notifications, improving onboarding and increasing lifetime engagement. Reported directly to the CEO & Chairman Management of the H&C TV website and apps \u0000IOS, Android, Amazon Fire TV, Roku, Samsung, Comcast) Managing a team of 20 with team 8 direct reports: Head of operations, Development teams (including external technology partners), UI/UX and Product Owner Created and delivered the digital product strategy and roadmap across all digital platforms Prioritised features based on commercial goals and development effort, ensuring the roadmap focused on high-value, strategically aligned work. Launched a cloud-based video subscription service across a suite of website, mobile and TV applications globally Reviewed and negotiated contracts for all external technology partners Tracking of key KPIs: App downloads, acquisitions, engagement metrics, funnel, exit survey results, customer survey feedback and customer feedback via Facebook and the customer support team Utilised various methods to collect feedback and analytical data to identify user pain points to feed into the product roadmap Managed stakeholders at all levels, including the CEO, Co-Founder, Marketing Director, Director of Content, and Creative Director, ensuring alignment and successful delivery of initiatives Developed an MVP for a content recommendation engine that enhanced discovery through curated and related content.\"\nSenior Product Manager (Contract)  \n07/2022 – 11/2022  \nSero Life Ltd (IoT Energy Supplier)  \nLed a portfolio of products, including an app that had been delayed for 9 months due to technical issues after £100K had been spent. Managed cross-functional teams (development, marketing, and customer service) to successfully release the app within 4 months, saving an additional £100K by utilising internal development teams. The timely release prevented customer complaints.  \nManaged a product portfolio of apps and internal platforms, leading a cross-functional team (internal & external)  \nConducted B2B customer feedback meetings to improve internal products and services  \nLed product planning and prioritisation sessions with stakeholders  \nImplemented product launch plans and collected data insights for roadmap features  \nCollaborated with the CEO and co-founder, marketing, development teams (internal & external), UI/UX, customer teams & PMO  \nManaged the Integration of hardware with apps and web applications, processing complex data  \nUtilised customer data to understand pain points through feedback and tested a legacy app to and drive improvements  \n\nProduct Manager  \n02/2018 – 12/2018  \nID Mobile (Carphone Warehouse)  \nI led the creation and execution of the digital self-service roadmap for ID Mobile’s customer portal, collaborating with stakeholders, UI/UX teams, and external agencies. This initiative resulted in a revenue uplift of £250K–£500K and achieved £300K in cost savings for the call centre. I also used data analytics, customer feedback, and competitor analysis to shape the product strategy and introduced new service campaigns to enhance customer engagement across the app and web.  \n\nProduct Manager (Contract)  \n09/2016 – 07/2017  \nSimply Be (N Brown Retail Group)  \nI launched Simply Be’s first-ever app, taking it from concept to delivery, and worked directly with Simply Be's external development supplier and senior leadership – CEO/CTO – to ensure its success. In a start-up innovation environment, I communicated the product vision and led the roadmap planning. I also utilised customer feedback and Google Analytics data to help with decisions on the roadmap, enhancing the customer journey as part of the company’s broader digital transformation effort. Integration with app supplier APIs.  \n\nAdditional Product Roles  \n01/2014 – 01/2018  \nProduct Manager at HCL Technologies (Contract)  \nProduct Owner at River Island (Contract)  \nProduct Analyst at Aimia Data & Analytics  \nRestaurant Solutions Analyst at McDonalds"
    },
    "skills": {
      "text": "AI \u0000Artificial Intelligence)AWS Cloud  \nAgile DevelopmentAgileData Science  \nOpen Source Technologies  \nLarge Language Models \u0000LLM\u0000  \nStakeholder Management  \nCritical ThinkingPresentations  \nCross-functional Team Leadership  \nProduct StrategyCustomer Experience  \nPOCDigital Transformation  \nBudget Tracking  \nSupplier / Partner Management  \nConflict Management & Problem Solving  \nKPI TrackingPrioritisation Techniques  \nRisk ManagementData Governance  \nLow Code/No Code Platforms  \nProduct Lifecycle Management  \nBasic Programming Languages  \nCloud Based Platforms  \nTeam Management  \nStakeholder Engagement  \nPeople ManagementWorkshops  \nProduct Launch PlanningDiscovery  \nAgile Methodology  \nProject Management  \nCreate Product Roadmaps  \nUser ResearchQuality Assurance  \nMachine LearningScrum  \nBusiness StrategyNegotiation  \nMicrosoft OfficeA/B Testing  \nDigital StrategyKanban  \nScrum MethodologyPowerpoint  \nScrumSDLCAPIAPM  \nAgile Methodologies  \nBusiness IntelligenceAgile Scrum  \nStrategic PlanningProduct Innovation  \nPerformance Monitoring  \nPerformance AnalysisWaterfall  \nTechnical LeadershipEcommerce  \nBudget ManagementKPI reporting\n\"APPLICATIONS, TOOLS & TECHNOLOGIES Product BoardMondaysAhaMiro GithubAirtableGTMMailchimp Google DocsUrban Airship Azure DevOpsAsanaSnowflake ServiceNowEclipseAndroid SDK PhotoshopNotepad++MS Office VisioSha\"\nrePointe-commerce  \nCRM/CMS  \nJira  \nBalsamiq  \nLooka Studio  \nLucidchart  \nSitecore  \nGigya  \nOPTA  \niTunes Connect  \nGoogle Development Center  \niOS  \nAndroid  \nZapier  \nAWS  \nAzure  \nDatabricks  \nPowerapps  \nMendix  \nHTML  \nPHP  \nOOP  \nCSS  \nMySQL  \nMySQLi  \nJavaScript  \nAjax  \nJQuery  \nXML  \nJava  \nEXCEL  \nShopify  \nFreshdesk  \nFigma  \nERP  \nGoogle Analytics"
    },
    "education": {
      "text": "\"MSc in Computer Science University of Kent 01/2012 \u0000 01/2013 BA (Hons) International Business Management London Metropolitan University 01/2008 \u0000 01/2012\""
    }
  }
}