{
  "sections": {
    "personal_info": {
      "text": "ANGELINA MENCHON DYER, MSC\nProduct Leader | Driving Innovation, Amazing Customer \nExperiences, AI & Cutting-Edge Technology\nPorfolio\n\n",
      "original_header": "CONTACT"
    },
    "professional_summary": {
      "text": "Experienced Product Manager with 11 years working in the tech industry, specialising in \ndriving product vision and strategy within digital and innovation environments. Skilled at \ndriving the launch of greenfield products to deliver IoT, cloud, and AI-powered solutions. \nSeeking product manager or product owner roles in startups or established companies \nfocused on innovative technologies and revenue growth.\n\n",
      "original_header": "SUMMARY"
    },
    "work_experience": {
      "text": "Senior Product Manager (Contract)\n11/2025 - 04/2025\nthebigword\nThebigword is a global language technology company, providing translation and interpreting \nservices across government and enterprise sectors. I managed their flagship interpreting \nproduct portfolio—a complex B2B2C marketplace platform that provided face-to-face and \nvide remote services, matching interpreters with clients using advanced machine learning \nand algorithmic logic. High-profile users included the Ministry of Justice MOJ.\nReprioritised the 2025 roadmap based on commercial impact—replacing a 3-6 month \ndevelopment initiatives with features expected to bring in significantly more value \n£100K vs £10K to the business.\nPartnered with compliance and legal teams to implement GDPR-aligned processes, \nincluding Right to be Forgotten, ensuring platform compliance across high-sensitivity use \ncases.\nLed discovery initiatives to understand complex interpreter and client data such as \nqualifications, interpreter matching and rates to meet compliance standards and complex \nclient-specific rate structures.\nDefined and maintained the feature roadmap for multiple cross-functional business \ni nitiatives, aligning with strategic goals and stakeholder priorities.\nAttended client sites and industry summits to gather insights and user feedback, using \nfindings to guide product decisions.\nInitiate and coordinate early-stage planning for a generative AI integration project with an \nLLM provider, including a proof of concept POC\nLine management of a UX designer and Junior Product Manager\nWorked across multiple platforms (Mobile App & Web) and regions UK and EU\nSenior Product Owner / Product Manager (Contract)\n01/2024 - 11/2024\nJet2 Holidays (Package Holiday Provider)\nCovered a maternity leave, led Jet2's Pre-Travel data workstream and contributing to the \noverall strategy and roadmap. Leading the first-ever use of Generative AI within the \nworkstream to analyse data and generate insights for strategic decision-making, aimed at \ndriving millions in cost savings.\nManaged a cross-functional team of business analysts, data engineering, data scientists, \ndata visualisation experts, project management, stakeholders, SMEs\nCollaborating with stakeholders to validate strategic direction and prioritise the data \nroadmap\nWorked within a complex digital (data & product) transformation environment\nDelivered initiatives supporting data quality and governance processes\nConducted market research on AI LLM models, Generative AI, and machine learning to \nsupport product delivery\nMentored product managers, both senior and junior product managers\nEXPERIENCE\nProduct Manager (Contract)\n04/2023  10/2023\nPWC (Digital Consultancy)\nHelped secure proposals for a portfolio of internal projects valued at £100K, with potential \ncost savings in the millions. Led the launch of projects focused on the automation of \nprocesses to enhance data workflows and improve overall workforce productivity.\nLed multiple compliance and risk assessments, particularly in highly regulated sectors \n(e.g. financial audits at PwC, ensuring secure and responsible product delivery.\nLed product discovery sessions to understand business value of launching products by \nlooking at pain points, possible gains and overall impact within the business\nManaged a cross-functional development team (developers, UI/UX designers, testers) to \ndeliver low-code internal data products\nCollaborated with stakeholders to build strategic product roadmaps, introducing practices \nsuch as the RICE model\nBudget tracking across multiple product. Contributed as a member of the Product \nManagement Community of Practice, supported colleagues with product knowledge\nSenior Product Manager (Contract)\n01/2023  03/2023\nBBC Bitesize (Broadcasting & Education)\nDelivered a strategic roadmap for the BBC to increase user engagement, aligned with \nbusiness goals. Conducted extensive research, utilising external user research results and \ninternal data analytics, to enhance customer journeys and optimise user experience.\nLed a discovery project to enhance site engagement, working closely with stakeholders\nUtilised research and collaborated with data analysts to set up key insights and reporting\nProvided product strategy and roadmap recommendations\nWorked with stakeholders Editorial, leads, product managers, UI/UX to bring concepts to \nlife\nOperated within a technology change and transformation environment\nDirector of Product\n12/2018  07/2022\nH&C TV (Equestrian Video Subscription Service)\nManaged the Customer Experience and Product departments, delivering key roadmap \nation initiatives aligned with business goals. These efforts contributed to a significant financial \nturnaround, increasing revenue from a negative position to £3M with strong year-on-year \ngrowth.\nPromoted to Director within a year by aligning product delivery with commercial \nobjectives, driving platform growth across mobile, web, and connected TV.\nPartnered with marketing to develop CRM journeys across email, app, and push \nnotifications, improving onboarding and increasing lifetime engagement.\nReported directly to the CEO & Chairman\nManagement of the H&C TV website and apps  IOS, Android, Amazon Fire TV, Roku, \nSamsung, Comcast)\nManaging a team of 20 with team 8 direct reports: Head of operations, Development \nteams (including external technology partners), UI/UX and Product Owner\nCreated and delivered the digital product strategy and roadmap across all digital \nplatforms\nPrioritised features based on commercial goals and development effort, ensuring the \nroadmap focused on high-value, strategically aligned work.\nLaunched a cloud-based video subscription service across a suite of website, mobile and \nTV applications globally\nReviewed and negotiated contracts for all external technology partners\nTracking of k\nSenior Product Manager (Contract)\n07/2022 - 11/2022\nSero Life Ltd (IoT Energy Supplier)\nLed a portfolio of products, including an app that had been delayed for 9 months due to technical issues after £100K had been spent. Managed cross-functional teams (development, marketing, and customer service) to successfully release the app within 4 months, saving an additional £100K by utilising internal development teams. The timely release prevented customer complaints.\nManaged a product portfolio of apps and internal platforms, leading a cross-functional team (internal & external)\nConducted B2B customer feedback meetings to improve internal products and services\nLed product planning and prioritisation sessions with stakeholders\nImplemented product launch plans and collected data insights for roadmap features\nCollaborated with the CEO and co-founder, marketing, development teams (internal & external), UI/UX, customer teams & PMO\nManaged the Integration of hardware with apps and web applications, processing complex data\nUtilised customer data to understand pain points through feedback and tested a legacy app to and drive improvements\nProduct Manager\n02/2018 - 12/2018\nID Mobile (Carphone Warehouse)\nI led the creation and execution of the digital self-service roadmap for ID Mobile’s customer portal, collaborating with stakeholders, UI/UX teams, and external agencies. This initiative resulted in a revenue uplift of £250K-£500K and achieved £300K in cost savings for the call centre. I also used data analytics, customer feedback, and competitor analysis to shape the product strategy and introduced new service campaigns to enhance customer engagement across the app and web.\nProduct Manager (Contract)\n09/2016 - 07/2017\nSimply Be (N Brown Retail Group)\nI launched Simply Be’s first-ever app, taking it from concept to delivery, and worked directly with Simply Be's external development supplier and senior leadership - CEO/CTO - to ensure its success. In a start-up innovation environment, I communicated the product vision and led the roadmap planning. I also utilised customer feedback and Google Analytics data to help with decisions on the roadmap, enhancing the customer journey as part of the company’s broader digital transformation effort. Integration with app supplier APIs.\nAdditional Product Roles01/2014 - 01/2018\nProduct Manager at HCL Technologies Contract)\nProduct Owner at River Island Contract)\nProduct Analyst at Aimia Data & Analytics\nRestaurant Solutions Analyst at McDonalds\n•\n•",
      "original_header": "EXPERIENCE"
    },
    "education": {
      "text": "\n\nMSc in Computer Science\nUniversity of Kent\n01/2012 - 01/2013\nBA (Hons) International \nBusiness Management\nLondon Metropolitan University\n01/2008 - 01/2012",
      "original_header": null
    },
    "skills": {
      "text": "AI  (Artificial Intelligence)AWS Cloud\nAgile DevelopmentAgileData Science\nOpen Source Technologies\nLarge Language Models  (LLM)\nStakeholder Management\nCritical ThinkingPresentations\nCross-functional Team Leadership\nProduct StrategyCustomer Experience\nPOCDigital Transformation\nBudget Tracking\nSupplier / Partner Management\nConflict Management & Problem Solving\nKPI TrackingPri\noritisation Techniques\nRisk ManagementData Governance\nLow Code/No Code Platforms\nProduct Lifecycle Management\nBasic Programming Languages\nCloud Based Platforms\nTeam Management\nStakeholder Engagement\nPeople ManagementWorkshops\nProduct Launch PlanningDiscovery\nAgile Methodology\nProject Management\nCreate Product Roadmaps\nUser ResearchQuality Assurance\nMachine LearningScrum\nBusiness StrategyNegotiation\nMicrosoft OfficeA/B Testing\nDigital StrategyKanban\nScrum MethodologyPowerpoint\nScrumSDLCAPIAPM\nAgile Methodologies\nBusiness IntelligenceAgile Scrum\nStrategic PlanningProduct Innovation\nPerformance Monitoring\nPerformance AnalysisWaterfall\nTechnical LeadershipEcommerce\nBudget ManagementKPI reporting\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\n•\nq\n",
      "original_header": "SKILLS"
    },
    "achievements": {
      "text": "Launched a data dashboard with LLM Gen AI technology enabling the \nbusiness to make decisions on multi-million pound cost saving initiatives\nAt H&C TV I achieved +500% subscriber growth in 3.7 years\nLaunched the 1st Simply Be retail app, generating £1M+ in less than a year\nCreated and presented £100K+ proposals to win projects internally at PWC\n\n",
      "original_header": "KEY ACHIEVEMENTS"
    },
    "certifications": {
      "text": "\n\n",
      "original_header": null
    },
    "languages": {
      "text": "\n\n",
      "original_header": null
    },
    "projects": {
      "text": "\n\n",
      "original_header": null
    }
  }
}