[
  {
    "section_type": "personal_info",
    "heading": "ANGELINA MENCHON DYER, MSC Product Leader | Driving Innovation, Amazing Customer   Experiences, AI & Cutting-Edge Technology Porfolio",
    "raw_text": "SUMMARY Experienced Product Manager with 11\u0000 years working in the tech industry, specialising in   driving product vision and strategy within digital and innovation environments. Skilled at   driving the launch of greenfield products to deliver IoT, cloud, and AI-powered solutions.   Seeking product manager or product owner roles in startups or established companies   focused on innovative technologies and revenue growth. KEY ACHIEVEMENTS Launched a data dashboard with LLM Gen AI technology enabling the   business to make decisions on multi-million pound cost saving initiatives At H&C TV I achieved +500% subscriber growth in 3.7 years Launched the 1st Simply Be retail app, generating \u00163M+ in less than a year Created and presented \u0016100K+ proposals to win projects internally at PWC"
  },
  {
    "section_type": "summary",
    "heading": "SUMMARY",
    "raw_text": "Experienced Product Manager with 11\u0000 years working in the tech industry, specialising in   driving product vision and strategy within digital and innovation environments. Skilled at   driving the launch of greenfield products to deliver IoT, cloud, and AI-powered solutions.   Seeking product manager or product owner roles in startups or established companies   focused on innovative technologies and revenue growth."
  },
  {
    "section_type": "achievements",
    "heading": "KEY ACHIEVEMENTS",
    "raw_text": "Launched a data dashboard with LLM Gen AI technology enabling the business to make decisions on multi-million pound cost saving initiatives At H&C TV I achieved +500% subscriber growth in 3.7 years Launched the 1st Simply Be retail app, generating £1M+ in less than a year Created and presented £100K+ proposals to win projects internally at PWC"
  },
  {
    "section_type": "experience",
    "heading": "EXPERIENCE",
    "raw_text": "Senior Product Manager (Contract) 11/2025 \u0000 04/2025 thebigword Thebigword is a global language technology company, providing translation and interpreting   services across government and enterprise sectors. I managed their flagship interpreting   product portfolio\u0014a complex B2B2C  m a r k e t p l a c e   p l a t f o r m  that provided face-to-face and   video remote services, matching interpreters with clients using advanced machine learning   and algorithmic logic. High-profile users included the Ministry of Justice \u0000MOJ\u0000. Reprioritised the 2025 roadmap based on commercial impact\u0014replacing a 3\u00006 month   development initiatives with features expected to bring in significantly more value   \u001a\u00163100K\u001a\u0016 vs \u001a\u001610K\u001a\u0016 to the business. Partnered with compliance and legal teams to implement GDPR-aligned processes,   including Right to be Forgotten, ensuring platform compliance across high-sensitivity use   cases. Led discovery initiatives to understand complex interpreter and client data such as   qualifications, interpreter matching and rates to meet compliance standards and complex   client-specific rate structures. Defined and maintained the feature roadmap for multiple cross-functional business   initiatives, aligning with strategic goals and stakeholder priorities. Attended client sites and industry summits to gather insights and user feedback, using   findings to guide product decisions. Initiate and coordinate early-stage planning for a generative AI integration project with an   LLM provider, including a proof of concept \u001a\u0016POC\u001a\u0016 Line management of a UX designer and Junior Product Manager Worked across multiple platforms \u001aMobile App & Web) and regions \u001aUK and EU\u001a Senior Product Owner / Product Manager (Contract) 01/2024 \u0000 11/2024 Jet2 Holidays (Package Holiday Provider) Covered a maternity leave, led Jet2's Pre-Travel data workstream and contributing to the   overall strategy and roadmap. Leading the first-ever use of Generative AI within the   workstream to analyse data and generate insights for strategic decision-making, aimed at   driving millions in cost savings. Managed a cross-functional team of business analysts, data engineering, data scientists,   data visualisation experts, project management, stakeholders, SMEs Collaborating with stakeholders to validate strategic direction and prioritise the data   roadmap Worked within a complex digital (data & product) transformation environment Delivered initiatives supporting data quality and governance processes Conducted market research on AI LLM models, Generative AI, and machine learning to   support product delivery Mentored product managers, both senior and junior product managers\n\nEXPERIENCE Product Manager (Contract) 04/2023 \u0000 10/2023 PWC (Digital Consultancy) Helped secure proposals for a portfolio of internal projects valued at \u00163100K, with potential   cost savings in the millions. Led the launch of projects focused on the automation of   processes to enhance data workflows and improve overall workforce productivity. Led multiple compliance and risk assessments, particularly in highly regulated sectors   (e.g. financial audits at PwC\u001a, ensuring secure and responsible product delivery. Led product discovery sessions to understand business value of launching products by   looking at pain points, possible gains and overall impact within the business Managed a cross-functional development team (developers, UI/UX designers, testers) to   deliver low-code internal data products Collaborated with stakeholders to build strategic product roadmaps, introducing practices   such as the RICE model Budget tracking across multiple product. Contributed as a member of the Product   Management Community of Practice, supported colleagues with product knowledge Senior Product Manager (Contract) 01/2023 \u0000 03/2023 BBC Bitesize (Broadcasting & Education) Delivered a strategic roadmap for the BBC to increase user engagement, aligned with   business goals. Conducted extensive research, utilising external user research results and   internal data analytics, to enhance customer journeys and optimise user experience. Led a discovery project to enhance site engagement, working closely with stakeholders Utilised research and collaborated with data analysts to set up key insights and reporting Provided product strategy and roadmap recommendations Worked with stakeholders \u001aEditorial, leads, product managers, UI/UX\u001a to bring concepts to   life Operated within a technology change and transformation environment Director of Product 12/2018 \u0000 07/2022 H&C TV (Equestrian Video Subscription Service) Managed the Customer Experience and Product departments, delivering key roadmap   initiatives aligned with business goals. These efforts contributed to a significant financial   turnaround, increasing revenue from a negative position to \u00163M with strong year-on-year   growth. Promoted to Director within a year by aligning product delivery with commercial   objectives, driving platform growth across mobile, web, and connected TV. Partnered with marketing to develop CRM journeys across email, app, and push   notifications, improving onboarding and increasing lifetime engagement. Reported directly to the CEO & Chairman Management of the H&C TV website and apps \u001aIOS, Android, Amazon Fire TV, Roku,   Samsung, Comcast\u001a Managing a team of 20 with team 8 direct reports: Head of operations, Development   teams (including external technology partners), UI/UX and Product Owner Created and delivered the digital product strategy and roadmap across all digital   platforms Prioritised features based on commercial goals and development effort, ensuring the   roadmap focused on high-value, strategically aligned work. Launched a cloud-based video subscription service across a suite of website, mobile and   TV applications globally Reviewed and negotiated contracts for all external technology partners Tracking of key KPIs: App downloads, acquisitions, engagement metrics, funnel, exit   survey results, customer survey feedback and customer feedback via Facebook and the   customer support team Utilised various methods to collect feedback and analytical data to identify user pain   points to feed into the product roadmap Managed stakeholders at all levels, including the CEO, Co-Founder, Marketing Director,   Director of Content, and Creative Director, ensuring alignment and successful delivery of   initiatives Developed an MVP for a content recommendation engine that enhanced discovery   through curated and related content.\n\nSenior Product Manager (Contract) 07/2022 \u0000 11/2022 Sero Life Ltd (IoT Energy Supplier) Led a portfolio of products, including an app that had been delayed for 9 months due to   technical issues after \u00163100K had been spent. Managed cross-functional teams   (development, marketing, and customer service) to successfully release the app within 4   months, saving an additional \u00163100K by utilising internal development teams. The timely   release prevented customer complaints. Managed a product portfolio of apps and internal platforms, leading a cross-functional   team (internal & external) Conducted B2B customer feedback meetings to improve internal products and services Led product planning and prioritisation sessions with stakeholders Implemented product launch plans and collected data insights for roadmap features Collaborated with the CEO and co-founder, marketing, development teams (internal &   external), UI/UX, customer teams & PMO Managed the Integration of hardware with apps and web applications, processing   complex data Utilised customer data to understand pain points through feedback and tested a legacy   app to and drive improvements Product Manager 02/2018 \u0000 12/2018 ID Mobile (Carphone Warehouse) I led the creation and execution of the digital self-service roadmap for ID Mobile’s customer   portal, collaborating with stakeholders, UI/UX teams, and external agencies. This initiative   resulted in a revenue uplift of \u0016250K\u001a\u0016500K and achieved \u0016300K in cost savings for the call   centre. I also used data analytics, customer feedback, and competitor analysis to shape the   product strategy and introduced new service campaigns to enhance customer engagement   across the app and web. Product Manager (Contract) 09/2016 \u0000 07/2017 Simply Be (N Brown Retail Group) I launched Simply Be’s first-ever app, taking it from concept to delivery, and worked directly   with Simply Be's external development supplier and senior leadership \u001aCEO/CTO\u001a to ensure   its success. In a start-up innovation environment, I communicated the product vision and led   the roadmap planning. I also utilised customer feedback and Google Analytics data to help   with decisions on the roadmap, enhancing the customer journey as part of the company’s   broader digital transformation effort. Integration with app supplier APIs. Additional Product Roles 01/2014 \u0000 01/2018 Product Manager at HCL Technologies \u001aContract) Product Owner at River Island \u001aContract) Product Analyst at Aimia Data & Analytics Restaurant Solutions Analyst at McDonalds \u001a\u001a\u001a\u001a\u001a\u001a\u001a\u001a\u001a\u001a"
  },
  {
    "section_type": "education",
    "heading": "EDUCATION",
    "raw_text": "MSc in Computer Science University of Kent 01/2012 \u0000 01/2013 BA (Hons) International   Business Management London Metropolitan University 01/2008 \u0000 01/2012"
  },
  {
    "section_type": "skills",
    "heading": "SKILLS",
    "raw_text": "AI  (Artificial Intelligence) AWS Cloud Agile Development Agile Data Science Open Source Technologies Large Language Models  (LLM) Stakeholder Management Critical Thinking Presentations Cross-functional Team Leadership Product Strategy Customer Experience POC Digital Transformation Budget Tracking Supplier / Partner Management Conflict Management & Problem Solving KPI Tracking Prioritisation Techniques Risk Management Data Governance Low Code/No Code Platforms Product Lifecycle Management Basic Programming Languages Cloud Based Platforms Team Management Stakeholder Engagement People Management Workshops Product Launch Planning Discovery Agile Methodology Project Management Create Product Roadmaps User Research Quality Assurance Machine Learning Scrum Business Strategy Negotiation Microsoft Office A/B Testing Digital Strategy Kanban Scrum Methodology Powerpoint Scrum SDLC API APM Agile Methodologies Business Intelligence Agile Scrum Strategic Planning Product Innovation Performance Monitoring Performance Analysis Waterfall Technical Leadership Ecommerce Budget Management KPI reporting • • • • • • • • • • • • • • q"
  },
  {
    "section_type": "applications_tools_technologies",
    "heading": "APPLICATIONS, TOOLS &   TECHNOLOGIES",
    "raw_text": "Product Board Mondays Aha Miro Github Airtable GTM Mailchimp Google Docs Urban Airship Azure DevOps Asana Snowflake ServiceNow Eclipse Android SDK Photoshop Notepad++ MS Office Visio SharePoint e-commerce CRM/CMS Jira Balsamiq Looka Studio Lucidchart Sitecore Gigya OPTA iTunes Connect Google Development Center iOS Android Zapier AWS Azure Databricks Powerapps Mendix HTML PHP OOP CSS MySQL MySQLi JavaScript Ajax JQuery XML Java. EXCEL Shopify Freshdesk Figma ERP Google Analytics"
  },
  {
    "section_type": "interests",
    "heading": "INTERESTS",
    "raw_text": "Level 1 Certified Scuba diver Low Code (FlutterFlow) App   Development • • • • • • • • • • • • • • • • • • • • • •  "
  }
]